In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('student_details.xlsx')

df

,id,prn,student_fname,student_mname,student_lname,student_email,student_batch
0,5,5,arsh,idk,vora,arsh@gmail.pk,gym
1,6,6,daksh,idk,soni,daksh@hotmail.com,music
2,7,7,aum,idk,kulkarni,aum@yahoo.com,bca

In [3]:
from datetime import datetime


now = datetime.now()

# Format 2022-09-04 01:15:00
curr_dt = now.strftime("%Y-%m-%d %H:%M:%S")

curr_dt # this is in mysql datetime format

df['dt'] = curr_dt

In [4]:
df

,id,prn,student_fname,student_mname,student_lname,student_email,student_batch,dt
0,5,5,arsh,idk,vora,arsh@gmail.pk,gym,2022-09-04 19:53:54
1,6,6,daksh,idk,soni,daksh@hotmail.com,music,2022-09-04 19:53:54
2,7,7,aum,idk,kulkarni,aum@yahoo.com,bca,2022-09-04 19:53:54

In [6]:
import mysql.connector

db = mysql.connector.connect(
host="localhost",
user="root",
password="root",
database="Student_details"
)

cursor = db.cursor()

In [7]:
print(cursor.execute("SELECT * FROM Students"))

None

In [8]:
"INSERT INTO Students VALUES (1, %s, %s, %s, ....)"

(1, 69, 'Kshipra', 'Dharmesh', 'Jadav', 'kdj@hotmail.com', 'btech', datetime.datetime(2022, 9, 4, 1, 15))
(2, 2, 'tarang', 'jayendra', 'lakhmapurkar', 'tarang@gmail.com', 'bca', datetime.datetime(2022, 9, 4, 11, 18, 59))
(3, 3, 'prit', 'mukesh', 'bakraniya', 'prit@hotmail.com', 'btech', datetime.datetime(2022, 9, 4, 11, 18, 59))
(4, 4, 'tapodhan', 'idk', 'padia', 'tapo@gmai.com', 'commerce', datetime.datetime(2022, 9, 4, 11, 18, 59))
(5, 5, 'arsh', 'idk', 'vora', 'arsh@gmail.pk', 'gym', datetime.datetime(2022, 9, 4, 11, 37, 23))
(6, 6, 'daksh', 'idk', 'soni', 'daksh@hotmail.com', 'music', datetime.datetime(2022, 9, 4, 11, 37, 23))
(7, 7, 'aum', 'idk', 'kulkarni', 'aum@yahoo.com', 'bca', datetime.datetime(2022, 9, 4, 11, 37, 23))

In [9]:
list(df.itertuples(index=False, name=None))

[(5, 5, 'arsh', 'idk', 'vora', 'arsh@gmail.pk', 'gym', '2022-09-04 19:53:54'),
 (6,
  6,
  'daksh',
  'idk',
  'soni',
  'daksh@hotmail.com',
  'music',
  '2022-09-04 19:53:54'),
 (7,
  7,
  'aum',
  'idk',
  'kulkarni',
  'aum@yahoo.com',
  'bca',
  '2022-09-04 19:53:54')]

In [11]:
        "INSERT INTO Students (id, prn, student_fname, student_mname, student_lname, student_email, student_batch, created_date) values (5, 5, arsh, idk, vora)"

'INSERT INTO Students (id, prn, student_fname, student_mname, student_lname, student_email, student_batch, created_date) values (%s, %s, %s, %s, %s, %s, %s, %s)'

In [10]:
df

,id,prn,student_fname,student_mname,student_lname,student_email,student_batch,dt
0,5,5,arsh,idk,vora,arsh@gmail.pk,gym,2022-09-04 19:53:54
1,6,6,daksh,idk,soni,daksh@hotmail.com,music,2022-09-04 19:53:54
2,7,7,aum,idk,kulkarni,aum@yahoo.com,bca,2022-09-04 19:53:54